# GetKeys Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable..::..GetKeys Method
ExportLinetypeTable Class See Also
---
Gets all the keys stored in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<ExportLinetypeKey> GetKeys()
```

Visual Basic
---
```text
Public Function GetKeys As IList(Of ExportLinetypeKey)
```

Visual C++
---
```text
public:
IList<ExportLinetypeKey^>^ GetKeys()
```

# ### Return Value
The keys.
# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace